# CannotCreateGeometryForPipe Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..CannotCreateGeometryForPipe Property
BuiltInFailures..::..PipingFailures Class See Also
---
Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateGeometryForPipe { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateGeometryForPipe As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateGeometryForPipe {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace